Revit 2026 API

# WorksharingUtilsCheckoutElements(Document, ISetElementId, TransactWithCentralOptions) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> CheckoutElements(
	Document document,
	ISet<ElementId> elementsToCheckout,
	TransactWithCentralOptions options
)
```
```vb
Public Shared Function CheckoutElements (
	document As Document,
	elementsToCheckout As ISet(Of ElementId),
	options As TransactWithCentralOptions
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ CheckoutElements(
	Document^ document,
	ISet<ElementId^>^ elementsToCheckout,
	TransactWithCentralOptions^ options
)
```
```fsharp
static member CheckoutElements :
        document : Document *
        elementsToCheckout : ISet<ElementId> *
        options : TransactWithCentralOptions -> ISet<ElementId>
```

#### Parameters

document Document

elementsToCheckout ISetElementId

options TransactWithCentralOptions

#### Return Value

ISetElementId

#### Reference

WorksharingUtils Class

CheckoutElements Overload

Autodesk.Revit.DB Namespace